
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/ISAWASHUN/aws-ecs-terraform/actions/runs/7014845038)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b3ef89bfa78b0582]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-00c0ff2d63eb7c1b5]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7b762bcf5433586]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f501f908d74e8b94]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05a4d2914ca9edc60]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0279be51cdd95b4c7]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f9db97024b495556]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-04644499e1d35015a]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05a9889ad7aa47660]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-09afe4d2b31cc1a60]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0d9de1c8bc96a790d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-02f39c8c10ab62646]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0fb0b19157666a587]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f501f908d74e8b941080289494]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-047e343b5a41f48ac]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db33977869800d9a]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0685761d5db013174]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0972f78fece1f608c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0df7b7b9e8938f85a]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0684b2b24e88ad24a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0699329c02acfbf41]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-02f39c8c10ab626461080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-09afe4d2b31cc1a601080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-0b3ef89bfa78b0582"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-0b3ef89bfa78b0582"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.alb: Creating...
aws_security_group.ecs: Creating...
aws_security_group.ecs: Creation complete after 3s [id=sg-09e7170c13ba44315]
aws_security_group.alb: Creation complete after 3s [id=sg-0aebc2e899f086fe5]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-2523706584]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"824d527931520ac911291612bda30b15a0ab51dc","Vars":{},"WorkflowName":"Terraform"} -->